
- Modulo 2 : Estadistica y Visualizacion de Datos
- Sesion : 02
- Fecha : 08/11/2025

In [4]:
import pandas as pd
import numpy as np

In [5]:
listado_docentes = {
    "0001": {
        "nombres": "Ana Maria",
        "apellidos": "Lopez Garcia",
        "edad": 34
    },
    "0002": {
        "nombres": "Juan Carlos",
        "apellidos": "Perez Soto",
        "edad": 45
        }
    }

print(listado_docentes["0002"])

{'nombres': 'Juan Carlos', 'apellidos': 'Perez Soto', 'edad': 45}

In [8]:
df = pd.DataFrame(listado_docentes)
print(df)

                   0001         0002
nombres       Ana Maria  Juan Carlos
apellidos  Lopez Garcia   Perez Soto
edad                 34           45

In [14]:
df[["0001"]]

                   0001
nombres       Ana Maria
apellidos  Lopez Garcia
edad                 34

In [15]:
df.head()

                   0001         0002
nombres       Ana Maria  Juan Carlos
apellidos  Lopez Garcia   Perez Soto
edad                 34           45

In [16]:
df["0003"] =  df["0002"]

In [18]:
df.head()

                   0001         0002         0003
nombres       Ana Maria  Juan Carlos  Juan Carlos
apellidos  Lopez Garcia   Perez Soto   Perez Soto
edad                 34           45           45

In [19]:
df["0004"] =  df["0003"] +df["0002"]

df.head()

                   0001         0002         0003                    0004
nombres       Ana Maria  Juan Carlos  Juan Carlos  Juan CarlosJuan Carlos
apellidos  Lopez Garcia   Perez Soto   Perez Soto    Perez SotoPerez Soto
edad                 34           45           45                      90

In [20]:
df.insert(1, "1111", df["0003"] )
df.head()

,0001,1111,0002,0003,0004
nombres,Ana Maria,Juan Carlos,Juan Carlos,Juan Carlos,Juan CarlosJuan Carlos
apellidos,Lopez Garcia,Perez Soto,Perez Soto,Perez Soto,Perez SotoPerez Soto
edad,34,45,45,45,90

In [23]:
df = df.assign( nuevo = ["Jose","Rubio",34])

In [24]:
df.head()

,0001,1111,0002,0003,0004,nuevo
nombres,Ana Maria,Juan Carlos,Juan Carlos,Juan Carlos,Juan CarlosJuan Carlos,Jose
apellidos,Lopez Garcia,Perez Soto,Perez Soto,Perez Soto,Perez SotoPerez Soto,Rubio
edad,34,45,45,45,90,34